org/2014-03-22-borealis.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS:   H:3 num:nil toc:nil \n:nil ::t |:t -:t f:t *:t <:t 
#+OPTIONS:   tex:t  d:nil todo:t pri:nil tags:not-in-toc
#+BEGIN_HTML
---
category: computer science and enginneering
layout: post
title: "borealis: install, run, understanding, change "
tags: [research, borealis, aurora]
---
{% include JB/setup %}

#+END_HTML

* server 和 client

HeaderServer has a member global catalog, a client application commit
a network diagram to HeaderServer, then HeaderServer determines which
elements goes to which nodes and deploys them using the deploy method.

DataPath类中，EnqueueThread用于接收来自客户端的数据，and every
Borealis node only has one input and one output implemented by
DataPath.

#+BEGIN_SRC C++ -n
void  DataPath::EnqueueThread::run()
{
    TCPAcceptor<DataHandler, ptr<DataHandler::DHArgs> >
                        acceptor(_data_loop,_data_add,args);

}
#+END_SRC
这里，TCPAcceptor的构造函数，最后调用NMSTL/net的
#+BEGIN_SRC C++ -n
    TCPAcceptor<DataHandler, ptr<DataHandler::DHArgs> >
                        acceptor(_data_loop,_data_add,args);
{
     if (f & acceptor) {
                setsockopt_struct(SOL_SOCKET, SO_REUSEADDR, int(1));
                if (bind(addr)) (ref:bind)
                    listen();
            } else {
                connect(addr); (ref:connect)
            }

}
#+END_SRC
很明显，line [[(bind)]] 创建服务器，line [[(connect)]] 创建客户端，在borealis
的服务器和客户端都是在这里建立的。

在AdminCatalog.cc中的QueryProcessor::add_xml_string(),当该string为head
标签时，则调用QueryProcessor::add_head_element(), 进而
#+BEGIN_SRC C++
 _head_client = new UpdateClient(InetAddress(endpoint), "BigGiantHead");
#+END_SRC
UpdateClient调用上面的line [[(connect)]] 将borealis节点自己称为
BigGiantHead的客户端，与其进行查询网络文件的交互，端口为35000。

在两个query位于不同的borealis节点时，upstream节点作为downstream节点的
publisher，因此在AdminCatolog.cc中的
QueryProcessor::subscribe_streams(),进而调用：
#+BEGIN_SRC C++
void  DataPath::add_output_path_client(CatalogSubscription sub)
{
 ptr<DataHandler>  dh(new DataHandler(_fast_dequeue_fwd._data_fwd_loop,
                                             TCPSocket(endpoint,
                                                       Socket::nonblocking),
                                             args));
//endpoint为downstream节点的ip地址
}
#+END_SRC
downstream节点也作为upstream节点的subscriber，其构建过程是从分析xml开始的，因此其调用堆栈为：

#+BEGIN_EXAMPLE
BasicComponent::endpoint_for()
BasicComponent::proxy_for()
BasicComponent::qp_for()
QueryProcessor::request_replicas()
QueryProcessor::local_add_subscriptions()
QueryProcessor::add_input_element()
QueryProcessor::add_xml_string()
#+END_EXAMPLE

在应用程序端，如test/simple/mytestdist，首先需要创建一个MedusaClient，
并设置用于接收结果的处理程序：
#+BEGIN_SRC C++
 _client = new MedusaClient(InetAddress());

 Status  status = _client->set_data_handler(
                                  InetAddress(Util::form_endpoint(MYTESTDIST_ENDPOINT,
                                                                  DEFAULT_MONITOR_PORT)),
                                  wrap(&outputHandler));

#+END_SRC
调用set_data_handler()后，进而调用NMSTL/net的Socket来将自己设置为服务
器端，端口为25000。

其次，为了提交和修改网络查询图，创建一个HeadClient，将自己设计成BigGiantHead的客户端，端口为
35000。

最后，为了流数据输入到某个Borealis节点，这个节点是查询网络中的首节点，
需要将自己创建为客户端：
#+BEGIN_SRC C++
if (!_client->set_data_path(MAX_BUFFER, Util::get_host_address("127.0.0.1"), 15000))
    {   ERROR << "Failed setting data path";
    }
    else
    {   DEBUG << "Set data path";

        _eventPacket = ptr<StreamEvent>(new StreamEvent(PACKET));
        _eventPacket->_inject = true;
    }

#+END_SRC
- python 版本 2.3
由于执行 demo/sigmod2005/cube/bot_src 目录下的setup过程中，python脚本
无法在FC12原始python版本下，有错误，下载python2.3的源码，编译
#+BEGIN_EXAMPLE
 cd /home/borealis/packages/Python-2.3
./configure --prefix=/home/borealis/builtTools/python/
make
make install
# 临时使用python，将原始/usr/bin/python重命名为python.bak
export PATH=$PATH:/home/borealis/builtTools/python/bin
#+END_EXAMPLE

* 运行demo中的cube
[[http://cubeengine.com/cube.php4][cube]] 是早期的第一人称射击游戏，现在的名称是[[http://assault.cubers.net/][AssaultCube]], 代码开源（被用
在布朗大学的 [[http://cs.brown.edu/courses/cs138/old/2006/][网络信息系统课程作业]] 中）。Borealis为了演示，修改了[[http://filebase.bots-united.com/index.php?act%3Dcategory&id%3D39][Cube
Bot version 0.2]] [fn:1]的源
代码，使得Borealis作为Cube引擎的一个服务器组件，在多人游戏中，游戏团队
的管理者可以注册连续查询服务，随时跟踪团队信息，以调整游戏策略。

无法知道Borealis所使用的cube源代码版本。Borealis在2005的SIGMOD上发表了
[[http://localhost:4000/reference/streamprocessing/sigmod05.demo.pdf][Distributed Operation in the Borealis Stream Processing Engine]], 并没有
描述是在borealis的哪个版本中运行的诸多细节，根据demo/sigmod2005/cube/
目录下的README说明，直接进行编译，无法通过，需要修改几处脚本文件和源代
码； 关于运行的指令也不是完全正确，需要做一些调整。

- 运行环境： 2.6.31.5-127.fc12.i686.PAE

- 要求安装的SDL包有：
#+BEGIN_EXAMPLE
SDL-devel-1.2.13-12.fc12.i686
SDL_mixer-1.2.8-13.fc12.i686
SDL-1.2.13-12.fc12.i686
SDL_mixer-devel-1.2.8-13.fc12.i686
SDL_image-devel-1.2.7-1.fc12.i686
SDL_image-1.2.7-1.fc12.i686
#+END_EXAMPLE

