_posts/2014-03-22-borealis.html
---
category: computer science and enginneering
layout: post
title: "borealis: install, run, understanding, change "
tags: [research, borealis, aurora]
---
{% include JB/setup %}

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">server 和 client</h2>
<div class="outline-text-2" id="text-1">
<p>
HeaderServer has a member global catalog, a client application commit
a network diagram to HeaderServer, then HeaderServer determines which
elements goes to which nodes and deploys them using the deploy method.
</p>

<p>
DataPath类中，EnqueueThread用于接收来自客户端的数据，and every
Borealis node only has one input and one output implemented by
DataPath.
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="linenr">1: </span><span style="color: #81a2be;">void</span>  <span style="color: #81a2be;">DataPath</span>::<span style="color: #81a2be;">EnqueueThread</span>::<span style="color: #de935f;">run</span>()
<span class="linenr">2: </span>{
<span class="linenr">3: </span>    <span style="color: #81a2be;">TCPAcceptor</span>&lt;DataHandler, <span style="color: #81a2be;">ptr</span>&lt;<span style="color: #81a2be;">DataHandler</span>::DHArgs&gt; &gt;
<span class="linenr">4: </span>                        <span style="color: #f0c674;">acceptor</span>(_data_loop,_data_add,args);
<span class="linenr">5: </span>
<span class="linenr">6: </span>}
</pre>
</div>
<p>
这里，TCPAcceptor的构造函数，最后调用NMSTL/net的
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="linenr"> 1: </span>    <span style="color: #81a2be;">TCPAcceptor</span>&lt;DataHandler, <span style="color: #81a2be;">ptr</span>&lt;<span style="color: #81a2be;">DataHandler</span>::DHArgs&gt; &gt;
<span class="linenr"> 2: </span>                        <span style="color: #de935f;">acceptor</span>(_data_loop,_data_add,args);
<span class="linenr"> 3: </span>{
<span class="linenr"> 4: </span>     <span style="color: #b5bd68;">if</span> (f &amp; acceptor) {
<span class="linenr"> 5: </span>                setsockopt_struct(SOL_SOCKET, SO_REUSEADDR, <span style="color: #81a2be;">int</span>(1));
<span id="coderef-bind" class="coderef-off"><span class="linenr"> 6: </span>                <span style="color: #b5bd68;">if</span> (bind(addr)) (bind)</span>
<span class="linenr"> 7: </span>                    listen();
<span class="linenr"> 8: </span>            } <span style="color: #b5bd68;">else</span> {
<span id="coderef-connect" class="coderef-off"><span class="linenr"> 9: </span>                connect(addr); (connect)</span>
<span class="linenr">10: </span>            }
<span class="linenr">11: </span>
<span class="linenr">12: </span>}
</pre>
</div>
<p>
很明显，line <a href="#coderef-bind"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-bind');" onmouseout="CodeHighlightOff(this, 'coderef-bind');">bind</a> 创建服务器，line <a href="#coderef-connect"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-connect');" onmouseout="CodeHighlightOff(this, 'coderef-connect');">connect</a> 创建客户端，在borealis
的服务器和客户端都是在这里建立的。
</p>

<p>
在AdminCatalog.cc中的QueryProcessor::add_xml_string(),当该string为head
标签时，则调用QueryProcessor::add_head_element(), 进而
</p>
<div class="org-src-container">

<pre class="src src-C++">_head_client = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">UpdateClient</span>(InetAddress(endpoint), <span style="color: #8abeb7;">"BigGiantHead"</span>);
</pre>
</div>
<p>
UpdateClient调用上面的line <a href="#coderef-connect"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-connect');" onmouseout="CodeHighlightOff(this, 'coderef-connect');">connect</a> 将borealis节点自己称为
BigGiantHead的客户端，与其进行查询网络文件的交互，端口为35000。
</p>

<p>
在两个query位于不同的borealis节点时，upstream节点作为downstream节点的
publisher，因此在AdminCatolog.cc中的
QueryProcessor::subscribe_streams(),进而调用：
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #81a2be;">void</span>  <span style="color: #81a2be;">DataPath</span>::<span style="color: #de935f;">add_output_path_client</span>(<span style="color: #81a2be;">CatalogSubscription</span> <span style="color: #f0c674;">sub</span>)
{
 <span style="color: #81a2be;">ptr</span>&lt;DataHandler&gt;  <span style="color: #f0c674;">dh</span>(<span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">DataHandler</span>(_fast_dequeue_fwd._data_fwd_loop,
                                             TCPSocket(endpoint,
                                                       <span style="color: #81a2be;">Socket</span>::nonblocking),
                                             args));
<span style="color: #969896; font-style: italic;">//</span><span style="color: #969896; font-style: italic;">endpoint&#20026;downstream&#33410;&#28857;&#30340;ip&#22320;&#22336;</span>
}
</pre>
</div>
<p>
downstream节点也作为upstream节点的subscriber，其构建过程是从分析xml开始的，因此其调用堆栈为：
</p>

<pre class="example">
BasicComponent::endpoint_for()
BasicComponent::proxy_for()
BasicComponent::qp_for()
QueryProcessor::request_replicas()
QueryProcessor::local_add_subscriptions()
QueryProcessor::add_input_element()
QueryProcessor::add_xml_string()
</pre>

<p>
在应用程序端，如test/simple/mytestdist，首先需要创建一个MedusaClient，
并设置用于接收结果的处理程序：
</p>
<div class="org-src-container">

<pre class="src src-C++">_client = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">MedusaClient</span>(InetAddress());

<span style="color: #81a2be;">Status</span>  <span style="color: #f0c674;">status</span> = _client-&gt;set_data_handler(
                                 InetAddress(<span style="color: #81a2be;">Util</span>::form_endpoint(MYTESTDIST_ENDPOINT,
                                                                 DEFAULT_MONITOR_PORT)),
                                 wrap(&amp;outputHandler));
</pre>
</div>
<p>
调用set_data_handler()后，进而调用NMSTL/net的Socket来将自己设置为服务
器端，端口为25000。
</p>

<p>
其次，为了提交和修改网络查询图，创建一个HeadClient，将自己设计成BigGiantHead的客户端，端口为
35000。
</p>

<p>
最后，为了流数据输入到某个Borealis节点，这个节点是查询网络中的首节点，
需要将自己创建为客户端：
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #b5bd68;">if</span> (<span style="color: #81a2be;">!</span>_client-&gt;set_data_path(MAX_BUFFER, <span style="color: #81a2be;">Util</span>::get_host_address(<span style="color: #8abeb7;">"127.0.0.1"</span>), 15000))
    {   ERROR &lt;&lt; <span style="color: #8abeb7;">"Failed setting data path"</span>;
    }
    <span style="color: #b5bd68;">else</span>
    {   DEBUG &lt;&lt; <span style="color: #8abeb7;">"Set data path"</span>;

        _eventPacket = <span style="color: #81a2be;">ptr</span>&lt;StreamEvent&gt;(<span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">StreamEvent</span>(PACKET));
        _eventPacket-&gt;_inject = <span style="color: #81a2be;">true</span>;
    }
</pre>
</div>
<ul class="org-ul">
<li>python 版本 2.3
</li>
</ul>
<p>
由于执行 demo/sigmod2005/cube/bot_src 目录下的setup过程中，python脚本
无法在FC12原始python版本下，有错误，下载python2.3的源码，编译
</p>
<pre class="example">
 cd /home/borealis/packages/Python-2.3
./configure --prefix=/home/borealis/builtTools/python/
make
make install
# 临时使用python，将原始/usr/bin/python重命名为python.bak
export PATH=$PATH:/home/borealis/builtTools/python/bin
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">运行demo中的cube</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://cubeengine.com/cube.php4">cube</a> 是早期的第一人称射击游戏，现在的名称是<a href="http://assault.cubers.net/">AssaultCube</a>, 代码开源（被用
在布朗大学的 <a href="http://cs.brown.edu/courses/cs138/old/2006/">网络信息系统课程作业</a> 中）。Borealis为了演示，修改了<a href="http://filebase.bots-united.com/index.php?act=category&id=39">Cube
Bot version 0.2</a> <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>的源
代码，使得Borealis作为Cube引擎的一个服务器组件，在多人游戏中，游戏团队
的管理者可以注册连续查询服务，随时跟踪团队信息，以调整游戏策略。
</p>

<p>
无法知道Borealis所使用的cube源代码版本。Borealis在2005的SIGMOD上发表了
<a href="http://localhost:4000/reference/streamprocessing/sigmod05.demo.pdf">Distributed Operation in the Borealis Stream Processing Engine</a>, 并没有
描述是在borealis的哪个版本中运行的诸多细节，根据demo/sigmod2005/cube/
目录下的README说明，直接进行编译，无法通过，需要修改几处脚本文件和源代
码； 关于运行的指令也不是完全正确，需要做一些调整。
</p>

<ul class="org-ul">
<li>运行环境： 2.6.31.5-127.fc12.i686.PAE
</li>

<li>要求安装的SDL包有：
</li>
</ul>
<pre class="example">
SDL-devel-1.2.13-12.fc12.i686
SDL_mixer-1.2.8-13.fc12.i686
SDL-1.2.13-12.fc12.i686
SDL_mixer-devel-1.2.8-13.fc12.i686
SDL_image-devel-1.2.7-1.fc12.i686
SDL_image-1.2.7-1.fc12.i686
</pre>
</div>
