org/2014-03-22-borealis.org
** 初始编译   
根据demo/sigmod2005/cube/README中的说明，
#+BEGIN_EXAMPLE
Platform:
        Linux 2.6x or 2.4x kernels with gcc-3.2 or higher.

Dependencies:

        (1) Borealis
        (2) NMSTL (/pro/sand/software/NMSTL)
        (3) SDL 1.2.7
        (4) SDL-mixer 1.2.5
        (5) SDL-image 1.2.3
        (6) xercesc 2.3.0
        (7) OpenGL, GLU

Compiling:
        (1) Setup and compile borealis includeing the tests, we use the version in subversion repository
        here: file:///pro/sand/games/svn/borealis/trunk borealis

        (2) Get the cube source code from subversion (file:///pro/sand/games/svn/cube/trunk) or get the tarfile.

        (3) cd cube/source/src

        (4) run ./setup
        (5) run configure e.g.,
        export SANDSOFT=/pro/sand/software
#+END_EXAMPLE

安装SDL版本有所不同，不影响编译。上面/Compiling/ 下的(1)(2)(3)描述的都
与下载的borealis不一致，(2)中的cube可以直接使用
demo/sigmod2005/cube/bot\under{}src下的源代码，(3)的路径应该
为:demo/sigmod2005/cube/bot\under{}src。另外执行(5)之前，需要修改configure文
件中SDL相关的的路径：由原来的
#+BEGIN_EXAMPLE
with_sdl_mixer=/usr/local
#+END_EXAMPLE
改为：
#+BEGIN_EXAMPLE
with_sdl_mixer=/usr
#+END_EXAMPLE
最终执行的操作如下：
#+BEGIN_EXAMPLE
cd demo/sigmod2005/cube/bot_src
./setup
./configure --with-xercesc=/home/borealis/builtTools/xerces --with-nmstl=/home/borealis/install_nmstl --with-borealis=/home/borealis/borealis
make
#+END_EXAMPLE

make的时候，会遇到如下错误和修改：
- 错误一
#+BEGIN_EXAMPLE
bot_util.h: In member function ‘bool TMultiChoice<C>::GetSelection(C&)’:
bot_util.h:539: 错误：‘pNode’ 在此作用域中尚未声明

bot_util.h: In member function ‘bool TMultiChoice<C>::GetSelection(C&) [with C = char*]’:
bot.cpp:1151:   instantiated from here
bot_util.h:539: 错误：依赖名 ‘TLinkedList<TMultiChoice<C>::SMultiChoice*>::node_s’ 被解析为非类型，但实例化却产生了一个类型
bot_util.h:539: 附注：如果您想指定类型，请使用 ‘typename TLinkedList<TMultiChoice<C>::SMultiChoice*>::node_s’
make[2]: *** [bot.o] 错误 1
make[2]: Leaving directory `/home/borealis/borealis/demo/sigmod2005/cube/bot_src/src'
make[1]: *** [all-recursive] 错误 1
make[1]: Leaving directory `/home/borealis/borealis/demo/sigmod2005/cube/bot_src'
make: *** [all] 错误 2
#+END_EXAMPLE
将bot\under{}util.h的539行：
#+BEGIN_EXAMPLE
539 TLinkedList<SMultiChoice*>::node_s *pNode = pChoiceList->GetFirst();
#+END_EXAMPLE
改为：
#+BEGIN_EXAMPLE
539 typename TLinkedList<SMultiChoice*>::node_s *pNode = pChoiceList->GetFirst();
#+END_EXAMPLE
- 错误二
#+BEGIN_EXAMPLE
/home/borealis/builtTools/gcc/lib/gcc/i686-pc-linux-gnu/4.1.1/../../../../include/c++/4.1.1/bits/fstream.tcc: In member function ‘virtual typename std::basic_filebuf<_CharT, _Traits>::int_type std::basic_filebuf<_CharT, _Traits>::underflow()’:
/home/borealis/builtTools/gcc/lib/gcc/i686-pc-linux-gnu/4.1.1/../../../../include/c++/4.1.1/bits/fstream.tcc:289: 错误：expected unqualified-id before ‘(’ token
/home/borealis/builtTools/gcc/lib/gcc/i686-pc-linux-gnu/4.1.1/../../../../include/c++/4.1.1/bits/fstream.tcc: In member function ‘virtual std::streamsize std::basic_filebuf<_CharT, _Traits>::xsputn(const _CharT*, std::streamsize)’:
/home/borealis/builtTools/gcc/lib/gcc/i686-pc-linux-gnu/4.1.1/../../../../include/c++/4.1.1/bits/fstream.tcc:612: 错误：expected unqualified-id before ‘(’ token
make[2]: *** [bot.o] 错误 1
make[2]: Leaving directory `/home/borealis/borealis/demo/sigmod2005/cube/bot_src/src'
make[1]: *** [all-recursive] 错误 1
make[1]: Leaving directory `/home/borealis/borealis/demo/sigmod2005/cube/bot_src'
make: *** [all] 错误 2
#+END_EXAMPLE
fstream.tcc:289的内容为： 
#+BEGIN_EXAMPLE
/home/borealis/builtTools/gcc/include/c++/4.1.1/bits/fstream.tcc 289行的内容为：
__ilen = std::min(__avail, __buflen);
#+END_EXAMPLE
在bot\under{}src/src/tools.h中定义了
#+BEGIN_EXAMPLE
#define max(a,b) (((a) > (b)) ? (a) : (b))
#define min(a,b) (((a) < (b)) ? (a) : (b))
#+END_EXAMPLE
因此是因为名称相同造成的，修改成其它的名称即可。

- 错误三
#+BEGIN_EXAMPLE
gamesubscriber.h: In constructor ‘GameSubscriber::GameSubscriber(NMSTL::InetAddress, NMSTL::InetAddress, NMSTL::InetAddress, NMSTL::ptr<std::vector<NMSTL::ptr<BufferedSocket>, std::allocator<NMSTL::ptr<BufferedSocket> > > >)’:
gamesubscriber.h:133: 错误：用作消歧义的 ‘template’ 只能用于模板内
tools.h: In constructor ‘vector<T>::vector()’:
tools.h:148: 警告：‘gp’ 的实参不依赖模板参数，所以 ‘gp’ 的声明必须可用
tools.h: In constructor ‘hashtable<T>::hashtable()’:
tools.h:223: 警告：‘gp’ 的实参不依赖模板参数，所以 ‘gp’ 的声明必须可用
make[2]: *** [client.o] 错误 1
#+END_EXAMPLE
g++-4.1.1不允许在构造函数中初始化动态变量，而gamesubscriber.h:133行，
在构造函数内，有下面的语句：
#+BEGIN_EXAMPLE
file name: gamesubscriber.h
133 m_deploy_qp = m_deploy_endpoint.template get<Borealis::QueryProcessor>("QueryProcessor");
#+END_EXAMPLE
因此注释掉该行内容，并且可以在以后使用的时候，对其进行初始化，将该行移
到gamesubscriber.cpp的355行第一次使用m\under{}deploy\under{}qp的前面:
#+BEGIN_EXAMPLE
file name: gamesubscriber.cpp
354  m_deploy_qp = m_deploy_endpoint.template get<Borealis::QueryProcessor>("QueryProcessor");
355    if ( !m_deploy_qp ) {
356        WARN << "No Borealis node selected for deploying queries.";
357        return false;
358    }
#+END_EXAMPLE

** 最后四个错误
- 上面的步骤后，还是不能正常运行，由于borealis源代码中有一个错误：
#+BEGIN_SRC C++ -n -r
file name: tool/head/DeployDiagram.cc
Status  DeployDiagram::deploy_table_schema(// Target node in _pending.
                                           string   endpoint)
{
    CatalogTable   *table;

    TableMap::iterator  table_it;

    for (table_it  = _topology._table_map.begin();
         table_it != _topology._table_map.end(); ++table) (ref:table)

#+END_SRC
line [[(table)]] 的初始化和条件变量为table\under{}it，而增量变量为table，导致该循
环无法退出。
- netio.cpp 的宕机
#+BEGIN_SRC C++ -n
void handle_incoming_tuples()
{
   ptr<StreamEvent> evt(new StreamEvent());

          if (handler_it != handler_end) {
              assert(evt->_tuple_size == handler_it->second.first); (ref:assert)
  ...
}
#+END_SRC
line [[(assert)]] 现在的borealis版本并不处理\under{}tuple\under{}size，因此它的值为0，导
致这个断言永远失败，必须注释掉。
- to\under{}server\under{}map 引发的错误
在cube.xml中有个字段定义：
#+BEGIN_EXAMPLE
    <field name="to_server_map"        type="string"  size="131"/>
#+END_EXAMPLE
但是实际的值为131，导致运行失败。
- metl3.cgz引发的错误
cube\under{}client启动的时候，需要读取metl3.cgz,因此需要将cube的packages.tar，
解压到cube目录下。

通过比对 AssaultCube，应该是其早期的版本

