_posts/2014-03-22-borealis.html

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">初始编译</h3>
<div class="outline-text-3" id="text-2-1">
<p>
根据demo/sigmod2005/cube/README中的说明，
</p>
<pre class="example">
Platform:
        Linux 2.6x or 2.4x kernels with gcc-3.2 or higher.

Dependencies:

        (1) Borealis
        (2) NMSTL (/pro/sand/software/NMSTL)
        (3) SDL 1.2.7
        (4) SDL-mixer 1.2.5
        (5) SDL-image 1.2.3
        (6) xercesc 2.3.0
        (7) OpenGL, GLU

Compiling:
        (1) Setup and compile borealis includeing the tests, we use the version in subversion repository
        here: file:///pro/sand/games/svn/borealis/trunk borealis

        (2) Get the cube source code from subversion (file:///pro/sand/games/svn/cube/trunk) or get the tarfile.

        (3) cd cube/source/src

        (4) run ./setup
        (5) run configure e.g.,
        export SANDSOFT=/pro/sand/software
</pre>

<p>
安装SDL版本有所不同，不影响编译。上面/Compiling/ 下的(1)(2)(3)描述的都
与下载的borealis不一致，(2)中的cube可以直接使用
demo/sigmod2005/cube/bot_src下的源代码，(3)的路径应该
为:demo/sigmod2005/cube/bot_src。另外执行(5)之前，需要修改configure文
件中SDL相关的的路径：由原来的
</p>
<pre class="example">
with_sdl_mixer=/usr/local
</pre>
<p>
改为：
</p>
<pre class="example">
with_sdl_mixer=/usr
</pre>
<p>
最终执行的操作如下：
</p>
<pre class="example">
cd demo/sigmod2005/cube/bot_src
./setup
./configure --with-xercesc=/home/borealis/builtTools/xerces --with-nmstl=/home/borealis/install_nmstl --with-borealis=/home/borealis/borealis
make
</pre>

<p>
make的时候，会遇到如下错误和修改：
</p>
<ul class="org-ul">
<li>错误一
</li>
</ul>
<pre class="example">
bot_util.h: In member function ‘bool TMultiChoice&lt;C&gt;::GetSelection(C&amp;)’:
bot_util.h:539: 错误：‘pNode’ 在此作用域中尚未声明

bot_util.h: In member function ‘bool TMultiChoice&lt;C&gt;::GetSelection(C&amp;) [with C = char*]’:
bot.cpp:1151:   instantiated from here
bot_util.h:539: 错误：依赖名 ‘TLinkedList&lt;TMultiChoice&lt;C&gt;::SMultiChoice*&gt;::node_s’ 被解析为非类型，但实例化却产生了一个类型
bot_util.h:539: 附注：如果您想指定类型，请使用 ‘typename TLinkedList&lt;TMultiChoice&lt;C&gt;::SMultiChoice*&gt;::node_s’
make[2]: *** [bot.o] 错误 1
make[2]: Leaving directory `/home/borealis/borealis/demo/sigmod2005/cube/bot_src/src'
make[1]: *** [all-recursive] 错误 1
make[1]: Leaving directory `/home/borealis/borealis/demo/sigmod2005/cube/bot_src'
make: *** [all] 错误 2
</pre>
<p>
将bot_util.h的539行：
</p>
<pre class="example">
539 TLinkedList&lt;SMultiChoice*&gt;::node_s *pNode = pChoiceList-&gt;GetFirst();
</pre>
<p>
改为：
</p>
<pre class="example">
539 typename TLinkedList&lt;SMultiChoice*&gt;::node_s *pNode = pChoiceList-&gt;GetFirst();
</pre>
<ul class="org-ul">
<li>错误二
</li>
</ul>
<pre class="example">
/home/borealis/builtTools/gcc/lib/gcc/i686-pc-linux-gnu/4.1.1/../../../../include/c++/4.1.1/bits/fstream.tcc: In member function ‘virtual typename std::basic_filebuf&lt;_CharT, _Traits&gt;::int_type std::basic_filebuf&lt;_CharT, _Traits&gt;::underflow()’:
/home/borealis/builtTools/gcc/lib/gcc/i686-pc-linux-gnu/4.1.1/../../../../include/c++/4.1.1/bits/fstream.tcc:289: 错误：expected unqualified-id before ‘(’ token
/home/borealis/builtTools/gcc/lib/gcc/i686-pc-linux-gnu/4.1.1/../../../../include/c++/4.1.1/bits/fstream.tcc: In member function ‘virtual std::streamsize std::basic_filebuf&lt;_CharT, _Traits&gt;::xsputn(const _CharT*, std::streamsize)’:
/home/borealis/builtTools/gcc/lib/gcc/i686-pc-linux-gnu/4.1.1/../../../../include/c++/4.1.1/bits/fstream.tcc:612: 错误：expected unqualified-id before ‘(’ token
make[2]: *** [bot.o] 错误 1
make[2]: Leaving directory `/home/borealis/borealis/demo/sigmod2005/cube/bot_src/src'
make[1]: *** [all-recursive] 错误 1
make[1]: Leaving directory `/home/borealis/borealis/demo/sigmod2005/cube/bot_src'
make: *** [all] 错误 2
</pre>
<p>
fstream.tcc:289的内容为： 
</p>
<pre class="example">
/home/borealis/builtTools/gcc/include/c++/4.1.1/bits/fstream.tcc 289行的内容为：
__ilen = std::min(__avail, __buflen);
</pre>
<p>
在bot_src/src/tools.h中定义了
</p>
<pre class="example">
#define max(a,b) (((a) &gt; (b)) ? (a) : (b))
#define min(a,b) (((a) &lt; (b)) ? (a) : (b))
</pre>
<p>
因此是因为名称相同造成的，修改成其它的名称即可。
</p>

<ul class="org-ul">
<li>错误三
</li>
</ul>
<pre class="example">
gamesubscriber.h: In constructor ‘GameSubscriber::GameSubscriber(NMSTL::InetAddress, NMSTL::InetAddress, NMSTL::InetAddress, NMSTL::ptr&lt;std::vector&lt;NMSTL::ptr&lt;BufferedSocket&gt;, std::allocator&lt;NMSTL::ptr&lt;BufferedSocket&gt; &gt; &gt; &gt;)’:
gamesubscriber.h:133: 错误：用作消歧义的 ‘template’ 只能用于模板内
tools.h: In constructor ‘vector&lt;T&gt;::vector()’:
tools.h:148: 警告：‘gp’ 的实参不依赖模板参数，所以 ‘gp’ 的声明必须可用
tools.h: In constructor ‘hashtable&lt;T&gt;::hashtable()’:
tools.h:223: 警告：‘gp’ 的实参不依赖模板参数，所以 ‘gp’ 的声明必须可用
make[2]: *** [client.o] 错误 1
</pre>
<p>
g++-4.1.1不允许在构造函数中初始化动态变量，而gamesubscriber.h:133行，
在构造函数内，有下面的语句：
</p>
<pre class="example">
file name: gamesubscriber.h
133 m_deploy_qp = m_deploy_endpoint.template get&lt;Borealis::QueryProcessor&gt;("QueryProcessor");
</pre>
<p>
因此注释掉该行内容，并且可以在以后使用的时候，对其进行初始化，将该行移
到gamesubscriber.cpp的355行第一次使用m_deploy_qp的前面:
</p>
<pre class="example">
file name: gamesubscriber.cpp
354  m_deploy_qp = m_deploy_endpoint.template get&lt;Borealis::QueryProcessor&gt;("QueryProcessor");
355    if ( !m_deploy_qp ) {
356        WARN &lt;&lt; "No Borealis node selected for deploying queries.";
357        return false;
358    }
</pre>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">最后四个错误</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>上面的步骤后，还是不能正常运行，由于borealis源代码中有一个错误：
</li>
</ul>
<div class="org-src-container">

<pre class="src src-C++"><span class="linenr"> 1: </span><span style="color: #81a2be;">file</span> <span style="color: #de935f;">name</span>: tool/head/DeployDiagram.cc
<span class="linenr"> 2: </span>Status  <span style="color: #81a2be;">DeployDiagram</span>::<span style="color: #de935f;">deploy_table_schema</span>(<span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Target node in _pending.</span>
<span class="linenr"> 3: </span>                                           <span style="color: #81a2be;">string</span>   <span style="color: #f0c674;">endpoint</span>)
<span class="linenr"> 4: </span>{
<span class="linenr"> 5: </span>    <span style="color: #81a2be;">CatalogTable</span>   *<span style="color: #f0c674;">table</span>;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #81a2be;">TableMap</span>::<span style="color: #81a2be;">iterator</span>  <span style="color: #f0c674;">table_it</span>;
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>    <span style="color: #b5bd68;">for</span> (table_it  = _topology._table_map.begin();
<span id="coderef-table" class="coderef-off"><span class="linenr">10: </span>         table_it != _topology._table_map.end(); ++table)</span>
</pre>
</div>
<p>
line <a href="#coderef-table"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-table');" onmouseout="CodeHighlightOff(this, 'coderef-table');">10</a> 的初始化和条件变量为table_it，而增量变量为table，导致该循
环无法退出。
</p>
<ul class="org-ul">
<li>netio.cpp 的宕机
</li>
</ul>
<div class="org-src-container">

<pre class="src src-C++"><span class="linenr">1: </span><span style="color: #81a2be;">void</span> <span style="color: #de935f;">handle_incoming_tuples</span>()
<span class="linenr">2: </span>{
<span class="linenr">3: </span>   <span style="color: #81a2be;">ptr</span>&lt;StreamEvent&gt; <span style="color: #f0c674;">evt</span>(<span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">StreamEvent</span>());
<span class="linenr">4: </span>
<span class="linenr">5: </span>          <span style="color: #b5bd68;">if</span> (handler_it != handler_end) {
<span id="coderef-assert" class="coderef-off"><span class="linenr">6: </span>              assert(evt-&gt;_tuple_size == handler_it-&gt;second.first); (assert)</span>
<span class="linenr">7: </span>  ...
<span class="linenr">8: </span>}
</pre>
</div>
<p>
line <a href="#coderef-assert"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-assert');" onmouseout="CodeHighlightOff(this, 'coderef-assert');">assert</a> 现在的borealis版本并不处理_tuple_size，因此它的值为0，导
致这个断言永远失败，必须注释掉。
</p>
<ul class="org-ul">
<li>to_server_map 引发的错误
</li>
</ul>
<p>
在cube.xml中有个字段定义：
</p>
<pre class="example">
&lt;field name="to_server_map"        type="string"  size="131"/&gt;
</pre>
<p>
但是实际的值为131，导致运行失败。
</p>
<ul class="org-ul">
<li>metl3.cgz引发的错误
</li>
</ul>
<p>
cube_client启动的时候，需要读取metl3.cgz,因此需要将cube的packages.tar，
解压到cube目录下。
</p>

<p>
通过比对 AssaultCube，应该是其早期的版本
</p>
</div>
</div>
