org/2014-03-22-borealis.org
** 运行cube
在上一步编译中，执行cube/bot\unser{}src/setup后，会在cube目录下生成
run\under{}cube\under{}demo.sh文件，此文件跟borealis中其它如test/simple下的runtest文
件类似。从文件的game目标所列出的主要组合命令挨个分析：


#+BEGIN_SRC sh -n -r
game
        read_game_hosts $2 (ref:file)

        $0 clean  (ref:clean)
        $0 cls (ref:cls)
        sleep 1
        $0 metaoptimizer (ref:mp)
        sleep 3
        $0 borealis
        sleep 3

        for ip in ${HOSTS}; do
            env CLS_IP=${IP} IP="$ip" ${EXEC} bremote (ref:remote)
        done
        sleep 25

        $0 head (ref:head)
        sleep 3
        $0 gui-viz (ref:viz)
        exit 0
        ;;
#+END_SRC
+  line [[(file)]]  可以给出包含游戏主机ip地址的文件，通过[[(remote)]] 行和
  bremote所执行的命令知道，这些主机上将会启动borealis引擎。
+ line [[(clean)]] 删除一些以前运行的日志文件
+ line [[(cls)]] 与README文件中描述的“start the central lookup server”一
  致，但是在这个borealis版本中，并没有CentralLookupServer相关的源代码，
  在Makefile的一些注释中，发现些痕迹，并且从test下能运行的例子以及开
  发文档中，并不需要CentralLookupServer。应该是以前版本中的组件。接下
  来，[[(mp)]] 行中的metaoptimizer一样的被去掉了，由NHOptimizer代替。
+ line [[(head)]] 提交网络和网络布局文件到borealis节点。
#+BEGIN_SRC sh
 xterm -T BigGiantHead -geometry 80x20+20+50 -e env LD_LIBRARY_PATH=${LD_LIBRARY_PATH} sh -c "${BOREALIS_HEAD_HOME}/BigGiantHead ${QUERY_FILE} ${DEPLOY_FILE} 2>&1 | tee head.log" &
#+END_SRC
这行命令直接将两个文件cube.xml和cube\under{}deployment.xml提交到
borealis节点，但是现有的test/simple下的mytestdist和
test/composite/sunion/都是专门写一个函数如launchDiagram()，主要代码如下：
#+BEGIN_SRC C++ -n
    client = (HeadClient *)new HeadClient( InetAddress( HEAD_NODE,
                                                        DEFAULT_HEAD_PORT ));

    string query_file        = "cube.xml";
    string deployment_file   = "cube_deployment.xml";

    rpc = client->deploy_xml_file( query_file);
    if ( ! rpc.valid() )
    {
        WARN << "Error with query file " << rpc.stat();
        exit(0);
    }

    rpc = client->deploy_xml_file(deployment_file);
    if ( ! rpc.valid() )
    {
        WARN << "Error with deployment file " << rpc.stat();
        exit(0);
    }
#+END_SRC
因此原始的命令head也不能正确执行，将上面的c++代码生成deploy命令，并将
head的命令改成
#+BEGIN_SRC sh
xterm -T BigGiantHead -geometry 80x20+20+50 -e env LD_LIBRARY_PATH=${LD_LIBRARY_PATH} sh -c "${BOREALIS_HEAD_HOME}/BigGiantHead  2>&1 | tee head.log" &
#+END_SRC

+ line [[(viz)]] 没有准备运行
+ 最简单的运行，只用一个borealis节点，那么剩下的game代码如下
#+BEGIN_SRC sh -n
game
        $0 borealis 127.0.0.1:15000
        sleep 3

        $0 head
        sleep 3
        exit 0
        ;;
#+END_SRC

** 完整运行cube+borealis的步骤
+ 在一个终端运行
#+BEGIN_SRC sh
cd demo/sigmod2005/cube
./run_cube_demo game
#+END_SRC
+ 等到borealis节点和head都启动后，在另一个终端运行deploy命令：
#+BEGIN_SRC sh
cd demo/sigmod2005/cube/bot_src/src
./deploy
#+END_SRC
注： BigGiantHead收到远端提交命令后，只接收需要的文件名如这里的
cube.xml和cube\under{}deployment.xml，然后在当前运行BigGiantHead的目录
下找相应的文件，因此这里需要将cube/bot\under{}src/borealis\under{}if目录
下的两个xml文件拷贝到demo/sigmod2005/cube目录下，否则得到读文件失败的
信息。


* compile borealis i386 in FC20.x86_64
- config files
#+BEGIN_SRC sh
diff -r borealis/src/configure.ac borealis-ok/src/configure.ac
14,15c14,15
< CFLAGS="-g -Wall -Werror"
< CXXFLAGS="-g -Wall -Werror"
---
> CFLAGS="-g -Wall -Werror -m32"
> CXXFLAGS="-g -Wall -Werror -Wno-deprecated -m32"
#+END_SRC

#+BEGIN_SRC sh
diff -r borealis/test/configure.ac borealis-ok/test/configure.ac
14,15c14,15
< CFLAGS="-g -Wall -Werror"
< CXXFLAGS="-g -Wall -Werror"
---
> CFLAGS="-g -Wall -Werror -m32"
> CXXFLAGS="-g -Wall -Werror -m32"
#+END_SRC

#+BEGIN_SRC sh
diff -r borealis/tool/configure.ac borealis-ok/tool/configure.ac
14,15c14,15
< CFLAGS="-g -Wall -Werror"
< CXXFLAGS="-g -Wall -Werror"
---
> CFLAGS="-g -Wall -Werror -m32"
> CXXFLAGS="-g -Wall -Werror -m32"
#+END_SRC
#+BEGIN_SRC sh

#+END_SRC
#+BEGIN_SRC sh
diff -r borealis/utility/client/configure.ac borealis-fc20/utility/client/configure.ac
14,15c14,15
< CFLAGS="-g -Wall -Werror"
< CXXFLAGS="-g -Wall -Werror"
---
> CFLAGS="-g -Wall -Werror -m32"
> CXXFLAGS="-g -Wall -Werror -m32"

#+END_SRC

