_posts/2014-03-22-borealis.html

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">运行cube</h3>
<div class="outline-text-3" id="text-2-3">
<p>
在上一步编译中，执行cube/bot\unser{}src/setup后，会在cube目录下生成
run_cube_demo.sh文件，此文件跟borealis中其它如test/simple下的runtest文
件类似。从文件的game目标所列出的主要组合命令挨个分析：
</p>


<div class="org-src-container">

<pre class="src src-sh"><span class="linenr"> 1: </span>game
<span id="coderef-file" class="coderef-off"><span class="linenr"> 2: </span>        read_game_hosts $<span style="color: #f0c674;">2</span></span>
<span class="linenr"> 3: </span>
<span id="coderef-clean" class="coderef-off"><span class="linenr"> 4: </span>        $<span style="color: #f0c674;">0</span> clean</span>
<span id="coderef-cls" class="coderef-off"><span class="linenr"> 5: </span>        $<span style="color: #f0c674;">0</span> cls</span>
<span class="linenr"> 6: </span>        sleep 1
<span id="coderef-mp" class="coderef-off"><span class="linenr"> 7: </span>        $<span style="color: #f0c674;">0</span> metaoptimizer</span>
<span class="linenr"> 8: </span>        sleep 3
<span class="linenr"> 9: </span>        $<span style="color: #f0c674;">0</span> borealis
<span class="linenr">10: </span>        sleep 3
<span class="linenr">11: </span>
<span class="linenr">12: </span>        <span style="color: #b5bd68;">for</span> ip<span style="color: #b5bd68;"> in</span> ${<span style="color: #f0c674;">HOSTS</span>}; <span style="color: #b5bd68;">do</span>
<span id="coderef-remote" class="coderef-off"><span class="linenr">13: </span>            env <span style="color: #f0c674;">CLS_IP</span>=${<span style="color: #f0c674;">IP</span>} <span style="color: #f0c674;">IP</span>=<span style="color: #8abeb7;">"$ip"</span> ${<span style="color: #f0c674;">EXEC</span>} bremote</span>
<span class="linenr">14: </span>        <span style="color: #b5bd68;">done</span>
<span class="linenr">15: </span>        sleep 25
<span class="linenr">16: </span>
<span id="coderef-head" class="coderef-off"><span class="linenr">17: </span>        $<span style="color: #f0c674;">0</span> head</span>
<span class="linenr">18: </span>        sleep 3
<span id="coderef-viz" class="coderef-off"><span class="linenr">19: </span>        $<span style="color: #f0c674;">0</span> gui-viz</span>
<span class="linenr">20: </span>        <span style="color: #b5bd68;">exit</span> 0
<span class="linenr">21: </span>        ;;
</pre>
</div>
<ul class="org-ul">
<li>line <a href="#coderef-file"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-file');" onmouseout="CodeHighlightOff(this, 'coderef-file');">2</a>  可以给出包含游戏主机ip地址的文件，通过<a href="#coderef-remote"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-remote');" onmouseout="CodeHighlightOff(this, 'coderef-remote');">13</a> 行和
bremote所执行的命令知道，这些主机上将会启动borealis引擎。
</li>
<li>line <a href="#coderef-clean"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-clean');" onmouseout="CodeHighlightOff(this, 'coderef-clean');">4</a> 删除一些以前运行的日志文件
</li>
<li>line <a href="#coderef-cls"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-cls');" onmouseout="CodeHighlightOff(this, 'coderef-cls');">5</a> 与README文件中描述的“start the central lookup server”一
致，但是在这个borealis版本中，并没有CentralLookupServer相关的源代码，
在Makefile的一些注释中，发现些痕迹，并且从test下能运行的例子以及开
发文档中，并不需要CentralLookupServer。应该是以前版本中的组件。接下
来，<a href="#coderef-mp"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-mp');" onmouseout="CodeHighlightOff(this, 'coderef-mp');">7</a> 行中的metaoptimizer一样的被去掉了，由NHOptimizer代替。
</li>
<li>line <a href="#coderef-head"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-head');" onmouseout="CodeHighlightOff(this, 'coderef-head');">17</a> 提交网络和网络布局文件到borealis节点。
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">xterm -T BigGiantHead -geometry 80x20+20+50 -e env <span style="color: #f0c674;">LD_LIBRARY_PATH</span>=${<span style="color: #f0c674;">LD_LIBRARY_PATH</span>} sh -c <span style="color: #8abeb7;">"${BOREALIS_HEAD_HOME}/BigGiantHead ${QUERY_FILE} ${DEPLOY_FILE} 2&gt;&amp;1 | tee head.log"</span> &amp;
</pre>
</div>
<p>
这行命令直接将两个文件cube.xml和cube_deployment.xml提交到
borealis节点，但是现有的test/simple下的mytestdist和
test/composite/sunion/都是专门写一个函数如launchDiagram()，主要代码如下：
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="linenr"> 1: </span>client = (<span style="color: #81a2be;">HeadClient</span> *)<span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">HeadClient</span>( InetAddress( HEAD_NODE,
<span class="linenr"> 2: </span>                                                    DEFAULT_HEAD_PORT ));
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #81a2be;">string</span> <span style="color: #f0c674;">query_file</span>        = <span style="color: #8abeb7;">"cube.xml"</span>;
<span class="linenr"> 5: </span><span style="color: #81a2be;">string</span> <span style="color: #f0c674;">deployment_file</span>   = <span style="color: #8abeb7;">"cube_deployment.xml"</span>;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>rpc = client-&gt;deploy_xml_file( query_file);
<span class="linenr"> 8: </span><span style="color: #b5bd68;">if</span> ( <span style="color: #81a2be;">!</span> rpc.valid() )
<span class="linenr"> 9: </span>{
<span class="linenr">10: </span>    WARN &lt;&lt; <span style="color: #8abeb7;">"Error with query file "</span> &lt;&lt; rpc.stat();
<span class="linenr">11: </span>    exit(0);
<span class="linenr">12: </span>}
<span class="linenr">13: </span>
<span class="linenr">14: </span>rpc = client-&gt;deploy_xml_file(deployment_file);
<span class="linenr">15: </span><span style="color: #b5bd68;">if</span> ( <span style="color: #81a2be;">!</span> rpc.valid() )
<span class="linenr">16: </span>{
<span class="linenr">17: </span>    WARN &lt;&lt; <span style="color: #8abeb7;">"Error with deployment file "</span> &lt;&lt; rpc.stat();
<span class="linenr">18: </span>    exit(0);
<span class="linenr">19: </span>}
</pre>
</div>
<p>
因此原始的命令head也不能正确执行，将上面的c++代码生成deploy命令，并将
head的命令改成
</p>
<div class="org-src-container">

<pre class="src src-sh">xterm -T BigGiantHead -geometry 80x20+20+50 -e env <span style="color: #f0c674;">LD_LIBRARY_PATH</span>=${<span style="color: #f0c674;">LD_LIBRARY_PATH</span>} sh -c <span style="color: #8abeb7;">"${BOREALIS_HEAD_HOME}/BigGiantHead  2&gt;&amp;1 | tee head.log"</span> &amp;
</pre>
</div>

<ul class="org-ul">
<li>line <a href="#coderef-viz"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-viz');" onmouseout="CodeHighlightOff(this, 'coderef-viz');">19</a> 没有准备运行
</li>
<li>最简单的运行，只用一个borealis节点，那么剩下的game代码如下
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span class="linenr">1: </span>game
<span class="linenr">2: </span>        $<span style="color: #f0c674;">0</span> borealis 127.0.0.1:15000
<span class="linenr">3: </span>        sleep 3
<span class="linenr">4: </span>
<span class="linenr">5: </span>        $<span style="color: #f0c674;">0</span> head
<span class="linenr">6: </span>        sleep 3
<span class="linenr">7: </span>        <span style="color: #b5bd68;">exit</span> 0
<span class="linenr">8: </span>        ;;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">完整运行cube+borealis的步骤</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>在一个终端运行
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b294bb;">cd</span> demo/sigmod2005/cube
./run_cube_demo game
</pre>
</div>
<ul class="org-ul">
<li>等到borealis节点和head都启动后，在另一个终端运行deploy命令：
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b294bb;">cd</span> demo/sigmod2005/cube/bot_src/src
./deploy
</pre>
</div>
<p>
注： BigGiantHead收到远端提交命令后，只接收需要的文件名如这里的
cube.xml和cube_deployment.xml，然后在当前运行BigGiantHead的目录
下找相应的文件，因此这里需要将cube/bot_src/borealis_if目录
下的两个xml文件拷贝到demo/sigmod2005/cube目录下，否则得到读文件失败的
信息。
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">compile borealis i386 in FC20.x86_64</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>config files
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">diff -r borealis/src/configure.ac borealis-ok/src/configure.ac
14,15c14,15
&lt; <span style="color: #f0c674;">CFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror"</span>
&lt; <span style="color: #f0c674;">CXXFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror"</span>
---
&gt; <span style="color: #f0c674;">CFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror -m32"</span>
&gt; <span style="color: #f0c674;">CXXFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror -Wno-deprecated -m32"</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">diff -r borealis/test/configure.ac borealis-ok/test/configure.ac
14,15c14,15
&lt; <span style="color: #f0c674;">CFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror"</span>
&lt; <span style="color: #f0c674;">CXXFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror"</span>
---
&gt; <span style="color: #f0c674;">CFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror -m32"</span>
&gt; <span style="color: #f0c674;">CXXFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror -m32"</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">diff -r borealis/tool/configure.ac borealis-ok/tool/configure.ac
14,15c14,15
&lt; <span style="color: #f0c674;">CFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror"</span>
&lt; <span style="color: #f0c674;">CXXFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror"</span>
---
&gt; <span style="color: #f0c674;">CFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror -m32"</span>
&gt; <span style="color: #f0c674;">CXXFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror -m32"</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh"></pre>
</div>
<div class="org-src-container">

<pre class="src src-sh">diff -r borealis/utility/client/configure.ac borealis-fc20/utility/client/configure.ac
14,15c14,15
&lt; <span style="color: #f0c674;">CFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror"</span>
&lt; <span style="color: #f0c674;">CXXFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror"</span>
---
&gt; <span style="color: #f0c674;">CFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror -m32"</span>
&gt; <span style="color: #f0c674;">CXXFLAGS</span>=<span style="color: #8abeb7;">"-g -Wall -Werror -m32"</span>
</pre>
</div>
</div>
</div>
