org/2014-03-22-borealis.org
* visual viewer
Up to now, I verified whether these visual montors with Java were able
to run.

- tool/viewer
#+BEGIN_SRC sh
  [borealis@localhost viewer]$ ant run
#+END_SRC

it will run a GUI, it can load network query, such as fauttest.xml, in
Editor option, the network appears.

- tool/monitor
after simply running make cmd, monitor.jar is produced in lib, for
testing this monitor:
#+BEGIN_SRC sh
[borealis@localhost monitor]$ java -cp ./lib/ha.jar:./lib/monitor.jar:./lib/clientApi.jar:./lib/medusaXmlRpc.jar:./lib/xerces.jar ../../demo/ha/ha_config.xml 
#+END_SRC

the last argument is necessary, and it should be another file that
must include item "layout".
the above cmd will start a window. the concrete details are not clear.

ha.jar in the above cmd, it includes two files CountSchema.java and
PacketSchema.java. For getting ha.jar:
#+BEGIN_SRC sh
cd utility/unix
[borealis@localhost unix]$ ./build.borealis.sh -demo ;CountSchema.java and PacketSchema.java will be compiled.
cd ../../demo/ha
[borealis@localhost ha]$ jar cvf ./ha.jar ./*.class
#+END_SRC

- tool/statsView
this tool is used in [balazinska06][fn:2]'s Figure 5-4. It can be
produced by make under tool/statsView, and:

#+BEGIN_SRC sh
java -cp ./lib/monitor.jar monitor.Monitor 127
#+END_SRC

the last arg need more study.

* AvailabilityMonitor
#+BEGIN_SRC c
monitor_nodes() {
...
    // Re-scheduling monitoring task
    (new CallbackTimer(_my_loop,wrap(this,&AvailabilityMonitor::monitor_nodes)))->arm(Time::now() + Time::msecs(_ping_interval));

}

#+END_SRC

* ConsistencyMgr
#+BEGIN_SRC c++
void ConsistencyMngr::update_state(ConsistencyState new_state)
#+END_SRC

#+BEGIN_SRC c++
Status ConsistencyMngr::handle_control_tuples(ptr<StreamEvent> event)
#+END_SRC

#+BEGIN_SRC c++
typedef map<string, set<string> > ReplicaMap;
#+END_SRC

#+BEGIN_SRC c++
    /// Configuration of the query diagram.
    ///
    struct Topology
    {
        CatalogSchema::SchemaMap    _schema_map;       // Tuple Description
        StreamMap       _stream_map;       // Stream
        BoxMap          _box_map;          // Box
        TableMap        _table_map;        // Tables
        QueryMap        _query_map;        // Queries - Move to DeployDiagram.
    };

#+END_SRC

#+BEGIN_SRC c++
    // Network oriented approach to inter-site connections.
    typedef   map<Name, CatalogSubscription>            SubscriptionMap;
    typedef   map<InetAddress, SubscriptionMap>         StreamLinkMap;

#+END_SRC

#+BEGIN_SRC c++
// xml rpc
#define XML_RPC_PORT_OFFSET 1

// Fast data path
#define DATA_PORT_OFFSET 2

#+END_SRC

#+BEGIN_SRC c++
struct medusa_components
{
    IOEventLoop             &_loop;
    InetAddress              _addr;
//    ptr<HA>                   _ha;
    ptr<AvailabilityMonitor>  _avail_mon;
    ptr<LocalLoadShedder>     _local_ls;
    ptr<NHLoadShedder>        _nh_ls;
    ptr<NHOptimizer>          _nhopt;
    ptr<QOSOptimizer>         _qosopt;
    ptr<QueryProcessor>       _qp;

#+END_SRC

* SUnionQBox
For FT, SUnionQBox creates a Bucket per 500 millseconds, all inputing
tuples with different timestamp will be taken into different buckets
according the code:

#+BEGIN_SRC c++
millseconds = tuple_timestamp.to_millseconds()/500

interval_nb = timestamp_to_interval_nb(tuple_timestamp) 


typedef map<long long, ptr<Bucket> > Buckets;

Buckets _buckets;

#+END_SRC
interval_nb is used as _buckets' key, when getting a new tuple,
SUnionQBox first looks up a bucket from _buckets based on interval_nb,
and inserts the new tuple into the bucket, or creates a new bucket and
inserts the tuple into it.


dst_tuple.set_tuple_type(TupleType::UNDO) <- SControlQBox::emit_undo_tuple(const Tuple& src_tuple) <-
SOutputQBox::unpack_state()<- recovery_task::perform_task()  

SUnionBoxNoBucketState -> AbstractBoxState

SControlQBox::emit_undo_tuple()[set_tuple_type(TupleType::UNDO]<-
SOutputQBox::unpack_state() <- AuroraNode::recover() <-
ConsistencyMgr::launch_reconciliation() <-
ConsistencyMgr::request_authorization_response() <-
ConsistencyMgr::request_authorization()[if type == TupleType::RECONCILIATION_REQUSET] <-
ConsistencyMgr::handle_control_tuples() <-
ConsistencyMgr::monitor_control_stream()[
_qp._data_path.add_local_output_path_client(control_stream_name,
wrap(this,&ConsistencyMngr::handle_control_tuples));] 
* Footnotes



[fn:1] In video games, a bot is a type of weak AI expert system
software which for each instance of the program controls a player in
deathmatch, team deathmatch and/or cooperative human player, most
prominently in the first-person shooters (FPSs)。

[fn:2] Fault-Tolerance and Load Management in a Distributed Stream Processing System.
Magdalena Balazinska. PhD dissertation.



