_posts/2014-03-22-borealis.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">visual viewer</h2>
<div class="outline-text-2" id="text-4">
<p>
Up to now, I verified whether these visual montors with Java were able
to run.
</p>

<ul class="org-ul">
<li>tool/viewer
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">[borealis@localhost viewer]$ ant run
</pre>
</div>

<p>
it will run a GUI, it can load network query, such as fauttest.xml, in
Editor option, the network appears.
</p>

<ul class="org-ul">
<li>tool/monitor
</li>
</ul>
<p>
after simply running make cmd, monitor.jar is produced in lib, for
testing this monitor:
</p>
<div class="org-src-container">

<pre class="src src-sh">[borealis@localhost monitor]$ java -cp ./lib/ha.jar:./lib/monitor.jar:./lib/clientApi.jar:./lib/medusaXmlRpc.jar:./lib/xerces.jar ../../demo/ha/ha_config.xml
</pre>
</div>

<p>
the last argument is necessary, and it should be another file that
must include item "layout".
the above cmd will start a window. the concrete details are not clear.
</p>

<p>
ha.jar in the above cmd, it includes two files CountSchema.java and
PacketSchema.java. For getting ha.jar:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b294bb;">cd</span> utility/unix
[borealis@localhost unix]$ ./build.borealis.sh -demo ;CountSchema.java and PacketSchema.java will be compiled.
<span style="color: #b294bb;">cd</span> ../../demo/ha
[borealis@localhost ha]$ jar cvf ./ha.jar ./*.class
</pre>
</div>

<ul class="org-ul">
<li>tool/statsView
</li>
</ul>
<p>
this tool is used in [balazinska06]<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>'s Figure 5-4. It can be
produced by make under tool/statsView, and:
</p>

<div class="org-src-container">

<pre class="src src-sh">java -cp ./lib/monitor.jar monitor.Monitor 127
</pre>
</div>

<p>
the last arg need more study.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">AvailabilityMonitor</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #de935f;">monitor_nodes</span>() {
...
    <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Re-scheduling monitoring task</span>
    (<span style="color: #81a2be;">new</span> <span style="color: #f0c674;">CallbackTimer</span>(_my_loop,wrap(this,&amp;AvailabilityMonitor::monitor_nodes)))-&gt;arm(Time::now() + Time::msecs(_ping_interval));

}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">ConsistencyMgr</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #81a2be;">void</span> <span style="color: #81a2be;">ConsistencyMngr</span>::<span style="color: #de935f;">update_state</span>(<span style="color: #81a2be;">ConsistencyState</span> <span style="color: #f0c674;">new_state</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #81a2be;">Status</span> <span style="color: #81a2be;">ConsistencyMngr</span>::<span style="color: #de935f;">handle_control_tuples</span>(<span style="color: #81a2be;">ptr</span>&lt;StreamEvent&gt; <span style="color: #f0c674;">event</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b5bd68;">typedef</span> <span style="color: #81a2be;">map</span>&lt;<span style="color: #81a2be;">string</span>, <span style="color: #81a2be;">set</span>&lt;<span style="color: #81a2be;">string</span>&gt; &gt; <span style="color: #81a2be;">ReplicaMap</span>;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #969896; font-style: italic;">/// </span><span style="color: #969896; font-style: italic;">Configuration of the query diagram.</span>
<span style="color: #969896; font-style: italic;">///</span>
<span style="color: #b5bd68;">struct</span> <span style="color: #81a2be;">Topology</span>
{
    <span style="color: #81a2be;">CatalogSchema</span>::<span style="color: #81a2be;">SchemaMap</span>    <span style="color: #f0c674;">_schema_map</span>;       <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Tuple Description</span>
    <span style="color: #81a2be;">StreamMap</span>       <span style="color: #f0c674;">_stream_map</span>;       <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Stream</span>
    <span style="color: #81a2be;">BoxMap</span>          <span style="color: #f0c674;">_box_map</span>;          <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Box</span>
    <span style="color: #81a2be;">TableMap</span>        <span style="color: #f0c674;">_table_map</span>;        <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Tables</span>
    <span style="color: #81a2be;">QueryMap</span>        <span style="color: #f0c674;">_query_map</span>;        <span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Queries - Move to DeployDiagram.</span>
};
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Network oriented approach to inter-site connections.</span>
<span style="color: #b5bd68;">typedef</span>   <span style="color: #81a2be;">map</span>&lt;Name, CatalogSubscription&gt;            <span style="color: #81a2be;">SubscriptionMap</span>;
<span style="color: #b5bd68;">typedef</span>   <span style="color: #81a2be;">map</span>&lt;InetAddress, <span style="color: #81a2be;">SubscriptionMap</span>&gt;         <span style="color: #81a2be;">StreamLinkMap</span>;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">xml rpc</span>
<span style="color: #b294bb;">#define</span> <span style="color: #f0c674;">XML_RPC_PORT_OFFSET</span> 1

<span style="color: #969896; font-style: italic;">// </span><span style="color: #969896; font-style: italic;">Fast data path</span>
<span style="color: #b294bb;">#define</span> <span style="color: #f0c674;">DATA_PORT_OFFSET</span> 2
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b5bd68;">struct</span> <span style="color: #81a2be;">medusa_components</span>
{
    <span style="color: #81a2be;">IOEventLoop</span>             &amp;<span style="color: #f0c674;">_loop</span>;
    <span style="color: #81a2be;">InetAddress</span>              <span style="color: #f0c674;">_addr</span>;
<span style="color: #969896; font-style: italic;">//    </span><span style="color: #969896; font-style: italic;">ptr&lt;HA&gt;                   _ha;</span>
    <span style="color: #81a2be;">ptr</span>&lt;AvailabilityMonitor&gt;  <span style="color: #f0c674;">_avail_mon</span>;
    <span style="color: #81a2be;">ptr</span>&lt;LocalLoadShedder&gt;     <span style="color: #f0c674;">_local_ls</span>;
    <span style="color: #81a2be;">ptr</span>&lt;NHLoadShedder&gt;        <span style="color: #f0c674;">_nh_ls</span>;
    <span style="color: #81a2be;">ptr</span>&lt;NHOptimizer&gt;          <span style="color: #f0c674;">_nhopt</span>;
    <span style="color: #81a2be;">ptr</span>&lt;QOSOptimizer&gt;         <span style="color: #f0c674;">_qosopt</span>;
    <span style="color: #81a2be;">ptr</span>&lt;QueryProcessor&gt;       <span style="color: #f0c674;">_qp</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">SUnionQBox</h2>
<div class="outline-text-2" id="text-7">
<p>
For FT, SUnionQBox creates a Bucket per 500 millseconds, all inputing
tuples with different timestamp will be taken into different buckets
according the code:
</p>

<div class="org-src-container">

<pre class="src src-c++">millseconds = tuple_timestamp.to_millseconds()/500

interval_nb = timestamp_to_interval_nb(tuple_timestamp) 


<span style="color: #b5bd68;">typedef</span> <span style="color: #81a2be;">map</span>&lt;<span style="color: #81a2be;">long</span> <span style="color: #81a2be;">long</span>, <span style="color: #81a2be;">ptr</span>&lt;Bucket&gt; &gt; <span style="color: #81a2be;">Buckets</span>;

<span style="color: #81a2be;">Buckets</span> <span style="color: #f0c674;">_buckets</span>;
</pre>
</div>
<p>
interval_nb is used as _buckets' key, when getting a new tuple,
SUnionQBox first looks up a bucket from _buckets based on interval_nb,
and inserts the new tuple into the bucket, or creates a new bucket and
inserts the tuple into it.
</p>


<p>
dst_tuple.set_tuple_type(TupleType::UNDO) &lt;- SControlQBox::emit_undo_tuple(const Tuple&amp; src_tuple) &lt;-
SOutputQBox::unpack_state()&lt;- recovery_task::perform_task()  
</p>

<p>
SUnionBoxNoBucketState -&gt; AbstractBoxState
</p>

<p>
SControlQBox::emit_undo_tuple()[set_tuple_type(TupleType::UNDO]&lt;-
SOutputQBox::unpack_state() &lt;- AuroraNode::recover() &lt;-
ConsistencyMgr::launch_reconciliation() &lt;-
ConsistencyMgr::request_authorization_response() &lt;-
ConsistencyMgr::request_authorization()[if type == TupleType::RECONCILIATION_REQUSET] &lt;-
ConsistencyMgr::handle_control_tuples() &lt;-
ConsistencyMgr::monitor_control_stream()[
_qp._data_path.add_local_output_path_client(control_stream_name,
wrap(this,&amp;ConsistencyMngr::handle_control_tuples));] 
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
In video games, a bot is a type of weak AI expert system
software which for each instance of the program controls a player in
deathmatch, team deathmatch and/or cooperative human player, most
prominently in the first-person shooters (FPSs)。
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
Fault-Tolerance and Load Management in a Distributed Stream Processing System.
Magdalena Balazinska. PhD dissertation.
</p></div>


</div>
</div>
